S1Сtest/src/Documents/ЗаявлениеНаПредоставлениеГосуслуги/ЗаявлениеНаПредоставлениеГосуслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявлениеНаПредоставлениеГосуслуги</name>
  <attributes>
    <name>ГосУслуга</name>
    <type>
      <types>CatalogRef.ГосУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПоступленияЗаявления</name>
    <type>
      <types>CatalogRef.КаналыПоступленияЗаявлений</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателя</name>
    <type>
      <types>EnumRef.КатегорияПолучателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоляЗаявления</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидПоляЗаявления</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоля</name>
      <type>
        <types>Characteristic.ВидПоляЗаявления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

S1Сtest/src/Enums/КатегорияПолучателя/КатегорияПолучателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорияПолучателя</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

S1Сtest/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПаспортныеДанные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

S1Сtest/src/ChartsOfCharacteristicTypes/ВидПоляЗаявления/ВидПоляЗаявления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидПоляЗаявления</name>
  <type>
    <types>Boolean</types>
    <types>CatalogRef.ЗначенияПолейЗаявления</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>1000</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <predefined>
    <items>
      <name>ДатаЗаявления</name>
      <description>Дата заявления</description>
      <code>00006</code>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </items>
    <items>
      <name>ДатаРождения</name>
      <description>Дата рождения</description>
      <code>00002</code>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </items>
    <items>
      <name>НаименованиеОрганизации</name>
      <description>Наименование организации</description>
      <code>00004</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПаспортныеДанные</name>
      <description>Паспортные данные</description>
      <code>00003</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>РеквизитыОрганизации</name>
      <description>Реквизиты организации</description>
      <code>00005</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ФИО</name>
      <description>ФИО</description>
      <code>00001</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>КатегорияПолучателя</name>
    <type>
      <types>EnumRef.КатегорияПолучателя</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

S1Сtest/src/Documents/ЗаявлениеНаПредоставлениеГосуслуги/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Запускаем бизнес-процесс, если он еще не запущен
	
	Если Не Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Заявление", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПредоставлениеГосуслуги.Ссылка КАК БизнесПроцесс,
		|	ПредоставлениеГосуслуги.Стартован КАК Стартован
		|ИЗ
		|	БизнесПроцесс.ПредоставлениеГосуслуги КАК ПредоставлениеГосуслуги
		|ГДЕ
		|	ПредоставлениеГосуслуги.ЗаявлениеНаПредоставлениеГосуслуги = &Заявление";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Не Выборка.Стартован Тогда
				БизнесПроцессОбъект = Выборка.БизнесПроцесс.ПолучитьОбъект();
				БизнесПроцессОбъект.Старт();
			КонецЕсли;
		Иначе
			
			// Создаем
			БизнесПроцессОбъект = БизнесПроцессы.ПредоставлениеГосуслуги.СоздатьБизнесПроцесс();
			БизнесПроцессОбъект.Заполнить(Ссылка);
			БизнесПроцессОбъект.Записать();
			
			БизнесПроцессОбъект.Старт();
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Определяем / создаем получателя
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если КатегорияПолучателя = Перечисления.КатегорияПолучателя.ФизическоеЛицо Тогда
			
			ФИО = Документы.ЗаявлениеНаПредоставлениеГосуслуги.ЗначениеПоляЗаявления(
				ЭтотОбъект, ПланыВидовХарактеристик.ВидПоляЗаявления.ФИО);
			ДатаРождения = Документы.ЗаявлениеНаПредоставлениеГосуслуги.ЗначениеПоляЗаявления(
				ЭтотОбъект, ПланыВидовХарактеристик.ВидПоляЗаявления.ДатаРождения);
			ПаспортныеДанные = Документы.ЗаявлениеНаПредоставлениеГосуслуги.ЗначениеПоляЗаявления(
				ЭтотОбъект, ПланыВидовХарактеристик.ВидПоляЗаявления.ПаспортныеДанные);
				
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ФИО", ФИО);
			Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
			Запрос.УстановитьПараметр("ПаспортныеДанные", ПаспортныеДанные);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо
			|ИЗ
			|	Справочник.ФизическиеЛица КАК ФизическиеЛица
			|ГДЕ
			|	ФизическиеЛица.Наименование = &ФИО
			|	И ФизическиеЛица.ДатаРождения = &ДатаРождения
			|	И ФизическиеЛица.ПаспортныеДанные = &ПаспортныеДанные";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Получатель = Выборка.ФизическоеЛицо;
			Иначе
				
				// Создаем
				ФизическоеЛицоОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
				ФизическоеЛицоОбъект.Наименование = ФИО;
				ФизическоеЛицоОбъект.ДатаРождения = ДатаРождения;
				ФизическоеЛицоОбъект.ПаспортныеДанные = ПаспортныеДанные;
				ФизическоеЛицоОбъект.Записать();
				Получатель = ФизическоеЛицоОбъект.Ссылка;
				
			КонецЕсли;
			
		ИначеЕсли КатегорияПолучателя = Перечисления.КатегорияПолучателя.ЮридическоеЛицо Тогда
			
			НаименованиеОрганизации = Документы.ЗаявлениеНаПредоставлениеГосуслуги.ЗначениеПоляЗаявления(
				ЭтотОбъект, ПланыВидовХарактеристик.ВидПоляЗаявления.НаименованиеОрганизации);
			РеквизитыОрганизации = Документы.ЗаявлениеНаПредоставлениеГосуслуги.ЗначениеПоляЗаявления(
				ЭтотОбъект, ПланыВидовХарактеристик.ВидПоляЗаявления.РеквизитыОрганизации);
				
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("НаименованиеОрганизации", НаименованиеОрганизации);
			Запрос.УстановитьПараметр("РеквизитыОрганизации", РеквизитыОрганизации);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЮридическиеЛица.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ЮридическиеЛица КАК ЮридическиеЛица
			|ГДЕ
			|	ЮридическиеЛица.Наименование = &НаименованиеОрганизации
			|	И ЮридическиеЛица.Реквизиты = &РеквизитыОрганизации";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Получатель = Выборка.ФизическоеЛицо;
			Иначе
				
				// Создаем
				ЮридическоеЛицоОбъект = Справочники.ЮридическиеЛица.СоздатьЭлемент();
				ЮридическоеЛицоОбъект.Наименование = НаименованиеОрганизации;
				ЮридическоеЛицоОбъект.Реквизиты = РеквизитыОрганизации;
				ЮридическоеЛицоОбъект.Записать();
				Получатель = ЮридическоеЛицоОбъект.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
